[
    {
        "slug": "evaluate-startups",
        "title": "Inside Kernel: How We Evaluate Startups Before Investing",
        "category": "Business",
        "coverImage": "https://kernel-images.s3.amazonaws.com/blog/inside-kernel-how-we-evaluate-startups.jpg",
        "content": "<p>In venture capital, writing the check is just the beginning. At Kernel Equity, we believe great investing starts with deep curiosity, structured evaluation, and an unwavering belief in the potential of people. Every founder who pitches to us has a dream, but not every dream is venture-scale—and that distinction is what our investment process is designed to uncover.</p><h3>The Problem-First Lens</h3><p>We begin with a simple question:</p><p><strong>What problem is this startup solving, and why does it matter?</strong></p><p>If a startup isn’t addressing a real, urgent problem—or creating a significant opportunity that didn’t exist before—it’s unlikely to gain traction. We look for startups that can clearly articulate the “painkiller vs. vitamin” argument. In most cases, we lean toward painkillers.</p><p>But even painkillers need timing, and that’s where context comes in.</p><h3>Market Timing and Depth</h3><p>Some of the best ideas fail because the market isn’t ready. Others succeed wildly because they catch a wave just as it rises.</p><p>At Kernel, we ask:</p><ul><li>Is this market growing or shrinking?</li><li>Are customer behaviors shifting in a way that supports this?</li><li>Will this be a $100M+ opportunity in the next 5–7 years?</li></ul><p>We’re not just betting on a great product—we’re betting on the right product at the right time.</p><h3>Founders Over Everything</h3><p>We’ve backed products that changed. We’ve seen business models pivot. But we rarely regret backing strong founders.</p><p>We look for:</p><ul><li>Clarity of thought and communication</li><li>Grit and adaptability</li><li>A clear sense of “why this, why now, why you?”</li></ul><p>Founders who combine domain knowledge with the humility to learn are often the ones who build enduring companies. We don’t expect perfection—we expect progress.</p><h3>Traction and Signals</h3><p>Not every company we fund is post-revenue, but we do look for signals of velocity:</p><ul><li>Early customer adoption</li><li>Iteration speed</li><li>Data-backed learning loops</li><li>A clear go-to-market plan</li></ul><p>Traction tells us the market wants what you’re building. Momentum tells us you can deliver it consistently.</p><h3>Fit With Kernel</h3><p>Every VC firm has its own style. At Kernel Equity, we’re collaborative partners. We like rolling up our sleeves, being involved post-investment, and sharing our operator knowledge. We work best with founders who value that engagement.</p><p>We invest where we can add value—not just capital.</p><p>If you’re looking for silent money, we may not be the right partner.</p><p>If you’re looking for a long-term ally, we just might be.</p><h3>Final Thoughts</h3><p>Startups are unpredictable. But our evaluation process is designed to reduce avoidable risks while embracing calculated ones. At Kernel Equity, we’re not just betting on businesses—we’re backing builders.</p><p>If you’re building something bold, we’d love to hear from you.</p><p>Let’s build the future—together.</p><h4>Be Social:</h4><ul><li><a href=\"https://www.linkedin.com/company/kernel-equity\">LinkedIn</a></li><li><a href=\"https://twitter.com/kernelequity\">Twitter</a></li><li><a href=\"https://www.instagram.com/kernelequity\">Instagram</a></li><li><a href=\"https://www.facebook.com/kernelequity\">Facebook</a></li></ul>",
        "createdBy": "Rahul Upadhyay",
        "createdAt": "15/05/2025"
    },
    {
        "slug": "venture-vision",
        "title": "Fueling Innovation: Kernel Equity’s Venture Capital Vision",
        "category": "Business",
        "coverImage": "https://kernel-images.s3.amazonaws.com/blog/fueling-innovation.jpg",
        "content": "<p>Venture capital (VC) is the financial backbone behind some of the most transformative startups in the world. It represents not just capital investment but also strategic mentorship, operational guidance, and long-term partnership. At Kernel Equity, venture capital is more than funding — it’s about building the future.</p><h3>What Is Venture Capital?</h3><p>Venture capital is a type of private equity focused on investing in early-stage, high-potential startups. In return for equity, VC firms provide the financial support and strategic insights needed to help these businesses grow, scale, and succeed in competitive markets. Unlike traditional loans, VC funding is a long-term partnership, often supporting multiple stages of a company’s lifecycle.</p><h3>Kernel Equity’s Venture Capital Approach</h3><p>At Kernel Equity (<a href=\"https://www.kernelequity.com\">www.kernelequity.com</a>), we take a founder-first approach to venture capital. We invest in innovative startups with strong teams, scalable ideas, and a clear path to impact. Our goal is to empower entrepreneurs not just with funding, but with the operational support and ecosystem they need to thrive.</p><p>We are deeply involved in the startups we back — from product roadmaps and go-to-market strategies to talent acquisition and legal structure. Our unique strength lies in how we combine strategic investments with hands-on mentorship, leveraging our in-house technology, legal, and marketing teams to add real value.</p><h3>What We Look For</h3><ul><li>Strong founding teams with clarity of vision</li><li>Disruptive ideas with long-term viability</li><li>Scalability in operations, technology, or service</li><li>Alignment with our core values of transparency, innovation, and resilience</li></ul><p>We primarily invest in early-stage and growth-stage companies across sectors like HealthTech, LegalTech, SaaS, FinTech, and platforms with strong community or enterprise potential.</p><h3>Our Active Ventures</h3><p>Here are some of the active ventures in our portfolio:</p><ol><li><strong>Compass</strong><br>An orthopaedic scheduling system by Medical Ventures, Inc., Compass streamlines the process of scheduling, tracking, planning, and reporting on surgeries. It captures associated data, tracks marketing expenses to ensure FDA compliance, and provides daily reconciliations.</li><li><strong>Tempo (Formerly Kalatech)</strong><br>Launched in 2014, Tempo offers music business solutions aimed at streamlining processes for booking agencies, tour management, and music publishers, allowing professionals to focus more on their creative endeavors.</li><li><strong>Time Miner</strong><br>Time Miner automates the process of finding past billable communications — calls, texts, and emails — and creates time entries. It integrates with platforms like RingCentral, Gmail, Outlook, and Clio Practice Management Software.</li><li><strong>Clarity Behavioural Health</strong><br>Clarity provides personalized treatment and relaxation content for in-patient behavioral health centers, aiming to improve patient outcomes through tailored interventions.</li><li><strong>Clearly Legal</strong><br>Clearly Legal offers engaging Continuing Legal Education (CLE) content in podcast format, with many courses available in 15-minute increments, and handles automatic reporting of hours.</li><li><strong>Creative Health Care Insight</strong><br>A cloud-based platform comprising two suites: Competency Suite and Professional Portfolio Suite. It streamlines processes, eliminates inefficiencies, and provides secure access to customized data, meeting ANCC requirements.</li><li><strong>HopDoc</strong><br>A virtual toolbox designed for medical practices, HopDoc provides digital solutions to help practices, urgent care clinics, and mental health providers thrive in a technology-driven healthcare landscape.</li><li><strong>Plankk</strong><br>Plankk is a platform focused on delivering health and fitness content, connecting users with fitness professionals and personalized workout programs.</li><li><strong>TheraVista Health</strong><br>Specializing in remote therapeutic monitoring, TheraVista Health focuses on vestibular rehabilitation, offering solutions that enhance patient care remotely.</li><li><strong>5 Star Finds</strong><br>A retail store located in Hendersonville, TN, 5 Star Finds specializes in overstock and liquidation goods, offering customers quality products at discounted prices.</li></ol><p>Kernel Equity is backed by a team of visionary leaders who actively engage in portfolio companies. For detailed information about our partners, please visit our Partners Page.</p><h3>Join Us on the Journey</h3><p>At Kernel Equity, we believe venture capital is a force multiplier. Whether you’re an early-stage founder with a bold vision or an investor looking to co-invest in purposeful innovation, we invite you to connect with us.</p><h4>Be Social:</h4><ul><li><a href=\"https://www.linkedin.com/company/kernel-equity\">LinkedIn</a></li><li><a href=\"https://twitter.com/kernelequity\">Twitter</a></li><li><a href=\"https://www.instagram.com/kernelequity\">Instagram</a></li><li><a href=\"https://www.facebook.com/kernelequity\">Facebook</a></li></ul>",
        "createdBy": "Rahul Upadhyay",
        "createdAt": "05/05/2025"
    },
    {
        "slug": "luinnovate-launch",
        "title": "Lipscomb University launches LUInnovate, appoints first chief innovation officer",
        "category": "Business",
        "coverImage": "https://kernel-images.s3.amazonaws.com/blog/luinnovate-launch.jpg",
        "content": "<p>Lipscomb University today announced the launch of LUInnovate, the university’s new Office of Innovation, dedicated to advancing Lipscomb’s mission through high-quality programming, strategic partnerships and innovative learning models. Leading this new initiative is Todd McCullough, who has been appointed the university’s first chief innovation officer.</p><p>McCullough, a seasoned executive with over three decades of experience advising Fortune 500 companies, global consulting firms, and higher education institutions, will spearhead LUInnovate’s efforts to expand Lipscomb’s reach and impact. His expertise in business strategy, innovation and organizational transformation has helped shape the growth of companies such as The Coca-Cola Company, Ford Motor Company, Target and Anthem. McCullough has also taught innovation and strategic growth at Vanderbilt University’s Owen Graduate School of Management and the Institute of Design at the Illinois Institute of Technology.</p><p>“LUInnovate represents another exciting step forward for Lipscomb University as we continue to cultivate a culture of creativity, entrepreneurship and forward-thinking education,” said Lipscomb President Candice McQueen. “With Todd McCullough’s leadership and our talented Lipscomb team, we are poised to continue to build innovative, high-quality programs that broaden access to education and drive meaningful impact.”</p><p>As chief innovation officer, McCullough will lead LUInnovate in developing innovative education models, identifying strategic business development opportunities and fostering collaboration across Lipscomb’s academic departments and external partners. His role aligns with a key goal of Lipscomb’s Impact 360 Strategic Plan, which focuses on fostering an entrepreneurial spirit while advancing the university’s distinctive mission.</p><p>“I am honored to join Lipscomb University in this new role,” said McCullough. “Higher education is considered one of the industries most in need of innovation. Lipscomb — a healthy, growing university with Christ-centered core values in the hot city of Nashville — is an ideal position to define and embody what the future of higher education can be.”</p><p>“I’m excited to partner with President McQueen and the Lipscomb community to take on the important challenge — to remain true to our principles while we adapt to flourish in an ever-changing environment.”</p><p>LUInnovate’s mission is to maximize exposure and access to Lipscomb University’s educational offerings through high-quality content, unique learning experiences and industry partnerships. The office will work closely with university leadership, faculty and external stakeholders to design and implement innovative programs and partnerships.</p><p>This work is being funded by significant investments in the Lipscomb Innovation Fund, which was initially started by a gift from Sue Nokes, a member of Lipscomb’s Board of Trustees, and has continued to grow due to the generosity of additional donors.</p><p>McCullough has a Bachelor of Business Administration degree from Harding University and a Master of Business Administration from Vanderbilt University. He will begin his work in this new role on Feb. 10.</p><h4>Be Social:</h4><ul><li><a href=\"https://www.linkedin.com/company/lipscomb-university\">LinkedIn</a></li><li><a href=\"https://twitter.com/lipscomb\">Twitter</a></li><li><a href=\"https://www.instagram.com/lipscombuniversity\">Instagram</a></li><li><a href=\"https://www.facebook.com/LipscombUniversity\">Facebook</a></li></ul>",
        "createdBy": "Kim Chaudoin",
        "createdAt": "07/02/2025"
    },
    {
        "slug": "clearly-legal-launch",
        "title": "Kernel Equity Launches CLEarly Legal: A Revolutionary CLE-by-Podcast App",
        "category": "Business",
        "coverImage": "https://kernel-images.s3.amazonaws.com/blog/clearly-legal-launch.jpg",
        "content": "<p><strong>Nashville, TN – November 8, 2024 –</strong> Kernel Equity, a Nashville-based investment firm, in collaboration with local attorneys Sean Martin and Joel Surber, is excited to announce the launch of CLEarly Legal, a cutting-edge app that makes it easier than ever for lawyers to earn and report Continuing Legal Education (CLE) hours to Bar Associations.</p><p>In response to the growing demand for accessible, flexible learning options, CLEarly Legal leverages the power of podcasts to deliver an engaging educational experience. The app offers a wide range of topics, from practice management to legal trends, allowing attorneys to earn CLE credits anytime, anywhere.</p><h4>Key Features of CLEarly Legal:</h4><ul><li><strong>Seamless Submission:</strong> Credit for completed CLE hours reported automatically.</li><li><strong>Diverse Content Library:</strong> Curated by industry experts, offering valuable insights on the latest legal topics such as practice management and current events.</li><li><strong>User-Friendly Interface:</strong> Designed for busy professionals, the app is easy to navigate and ensures a hassle-free experience for tracking and submitting CLE credits.</li><li><strong>Saving Money:</strong> Attorneys save money and billable hours by taking CLE when and where it’s convenient for them.</li></ul><p>“CLEarly Legal is more than just an app; it’s a revolution in how legal professionals engage with their continuing education. We’re making it easier than ever to stay current, connect with peers, and submit hours on the go,” said Sean Martin, co-founder. “Our goal is to empower lawyers to take charge of their learning journey, wherever they are.”</p><p>Joel Surber, co-founder, added, “At CLEarly Legal, we believe that continuing legal education should be as accessible and dynamic as the legal landscape itself. Our podcast platform empowers users to easily engage with top-notch content and seamlessly track their learning journey, transforming how lawyers earn their CLE hours.”</p><p>CLEarly Legal is available for download on both iOS and Android, with access through a web portal as well. Users can seamlessly switch between devices without losing their progress, ensuring a flexible learning experience that fits their busy schedules.</p><p>For more information, visit <a href=\"https://clearly.legal\">clearly.legal</a> or contact:</p><p><strong>Media Contact:</strong><br>Gwen Nellis<br>Senior Associate, Product<br>Kernel Equity<br><a href=\"mailto:contact@clearly.legal\">contact@clearly.legal</a></p><h4>Be Social:</h4><ul><li><a href=\"https://www.linkedin.com/company/clearly-legal\">LinkedIn</a></li><li><a href=\"https://twitter.com/clearlylegal\">Twitter</a></li><li><a href=\"https://www.instagram.com/clearlylegal\">Instagram</a></li><li><a href=\"https://www.facebook.com/clearlylegal\">Facebook</a></li></ul>",
        "createdBy": "Kernel Equity",
        "createdAt": "08/11/2024"
    },
    {
        "slug": "clarity-engage",
        "title": "Clarity Behavioral Health Software Unveils Engage™ - a Revolutionary SaaS Solution",
        "category": "Business",
        "coverImage": "https://kernel-images.s3.amazonaws.com/blog/clarity-behavioral-health-engage.jpg",
        "content": "<p><strong>NASHVILLE, TENNESSEE, UNITED STATES, August 22, 2023/EINPresswire.com/ --</strong> Clarity Behavioral Health Software (Clarity BHS) is proud to announce the partnership with and substantial funding investment from Kernel Equity for Clarity BHS’s innovative SaaS product, Engage. Designed to revolutionize patient care and operational efficiency in psychiatric hospitals and residential treatment centers across the United States, Engage marks a new era in behavioral health technology.</p><p>Clarity BHS, committed to serving the inpatient behavioral health market, brings together a team of experienced behavioral health and technology professionals. The company’s mission is to deliver high-quality solutions that facilitate better patient outcomes and increase hospital profitability.</p><p>Engage is a tablet-based software product developed to improve patient satisfaction with their treatment, decrease staff stress when delivering therapy services, and improve hospitals’ financial performance. The user-friendly design and sophisticated features make it an indispensable tool for healthcare providers in the behavioral health sector.</p><p><strong>Mike Tacke, Co-Founder and CEO of Clarity BHS, shares his enthusiasm:</strong> “Our partnership with Kernel Equity is enabling us to continue working towards bringing Engage to life. This product is more than just software; it’s a catalyst for transformative changes in the behavioral health industry.”</p><p>Kernel Equity, known for its strategic investments in promising start-ups, sees the potential of Engage and Clarity BHS. Their involvement and investment are instrumental in bringing this product to the market. Hospitals and residential treatment centers seeking to enhance their service delivery and improve patient outcomes are encouraged to explore the benefits of Engage.</p><p>Clarity BHS is a pioneering start-up specializing in behavioral health technology. They provide high-quality SaaS solutions to psychiatric hospitals and residential treatment centers across the USA, with a focus on improving patient outcomes and increasing profitability.</p><p>For more information or to schedule a demonstration, please contact:</p><p><strong>Stephanie Roberts</strong><br>Clarity BHS<br>+1 888-864-1344<br><a href=\"mailto:info@claritybhs.com\">email us here</a></p><h4>Be Social:</h4><ul><li><a href=\"https://www.linkedin.com/company/claritybhs\">LinkedIn</a></li><li><a href=\"https://twitter.com/claritybhs\">Twitter</a></li><li><a href=\"https://www.instagram.com/claritybhs\">Instagram</a></li><li><a href=\"https://www.facebook.com/claritybhs\">Facebook</a></li></ul>",
        "createdBy": "Beacon Media and Marketing",
        "createdAt": "07/06/2024"
    },
    {
        "slug": "blattner-devdigital",
        "title": "Blattner Tech Acquires DevDigital to Deepen Their Technical Expertise",
        "category": "Business",
        "coverImage": "https://kernel-images.s3.amazonaws.com/blog/blattner-tech-acquires-devdigital.jpg",
        "content": "<p><strong>NASHVILLE, Tenn., July 27, 2023 /PRNewswire/ --</strong> Blattner Tech, a renowned leader in Predictive Transformation services, products, and solutions in the Data Analytics, Artificial Intelligence, and Machine Learning industry, is pleased to announce the acquisition of DevDigital — a prominent digital transformation consultancy. This strategic merger will bolster Blattner Tech's technical bench depth and further improve its Predictive Transformation Platform.</p><p>DevDigital has built a strong reputation assisting organizations in navigating the digital transformation process from inception to execution. Their holistic approach encompasses brand and audience discovery, integrations, application development, and continuous evolution.</p><p><strong>\"We are thrilled to welcome DevDigital into the Blattner Tech family,\"</strong> said Russ Blattner, CEO of Blattner Tech. \"This strategic acquisition is a significant milestone for us as we expand our team, our capabilities, and broaden our service offerings. DevDigital's expertise in guiding organizations through digital transformation efforts aligns perfectly with our mission to empower businesses with predictive analytics and innovative technologies. Together, we will be better equipped to drive our clients' success in the ever-evolving digital landscape.\"</p><p>Peter Marcum, CEO of DevDigital, expressed enthusiasm about the acquisition, stating, \"This collaboration will empower us to create even more innovative and impactful solutions, combining our software development proficiency with Blattner Technologies' advanced data analytics and AI capabilities.\" With the transaction, Marcum will depart DevDigital after founding the company 15 years ago. He intends to continue focusing his time on equity investments as Founding Partner of Kernel Equity, LLC. DevDigital CFO, Debby Sapp, will remain with the company and assume the role of Senior Director of Finance for Blattner Tech.</p><p>Blattner Tech's acquisition of DevDigital underscores its commitment to delivering cutting-edge technology solutions and driving predictive transformation across industries. The integration of DevDigital's talented team and capabilities will further strengthen Blattner Technologies' position as a leader in the AI/ML space.</p><p>Learn more about these organizations:<br><a href=\"https://blattnertech.com/\" target=\"_blank\">Blattner Tech</a><br><a href=\"https://www.devdigital.com/\" target=\"_blank\">DevDigital</a></p><p><strong>SOURCE:</strong> Blattner Technologies</p><h4>Be Social:</h4><ul><li><a href=\"https://www.linkedin.com/company/blattner-tech\">LinkedIn</a></li><li><a href=\"https://twitter.com/blattnertech\">Twitter</a></li><li><a href=\"https://www.facebook.com/blattnertech\">Facebook</a></li><li><a href=\"https://www.instagram.com/blattnertech\">Instagram</a></li></ul>",
        "createdBy": "PR Newswire",
        "createdAt": "27/07/2023"
    },
    {
        "slug": "time-miner",
        "title": "Nashville Startup Time Miner Pursues B2B Platform Ties, Maps Capital Raises",
        "category": "Business",
        "coverImage": "https://kernel-images.s3.amazonaws.com/blog/time-miner-b2b-platform.jpg",
        "content": "<p><strong>EARLY-STAGE Time Miner LLC</strong> — mostly bootstrapped since its 2016 founding in Nashville — is raising outside capital for its cloud-based platform, which enables professionals who bill by-the-hour to schedule and launch automatic retrospective collection and recording of potentially billable time from their client-related VOIP/voice calls, email, and texting activity.</p><p>In the midst of rising competition for both legal-services clients and staff, there is growing awareness that overlooking hours that are meant to be billed, and failing to track nonbillable time can become significant drag on law firms' financial margins and, ultimately, on partner compensation.</p><p><strong>Sean Martin</strong><br>Co-Founder Sean Martin, 48, who is also founding partner of the 20-year-old MHPS law firm here, confirmed that Time Miner aims to raise $250K to $500K yet this year, with an eye toward expanding B2B integrations, sales and marketing.</p><p>In the years immediately following inception of the Time Miner business, management raised about $120K in outside capital and invested about $280K for bootstrap development and promotion of Time Miner's mobile app. The app currently remains active via iOS/Apple and Android/Google Play during the expansion of integrations via the Time Miner platform, which management deems a far more sophisticated offering than the app, which was also well received.</p><p>Martin confirmed for Venture Nashville that a further capital raise as early as 2H 2026 is contemplated.</p><p>Time Miner has achieved a B2B foothold in the high-priority legal-services sector, after several years of onboarding attorneys, accountants, business consultants and other fee-earning knowledge workers who must track and report billable time.</p><p>In 2018, significant exposure for the original Time Miner app resulted from its competitive debut in that year's ABA TECHSHOW \"Startup Alley\" expo and pitch competition. Related coverage.</p><p>Time Miner can track billable and predetermined no-bill time spent working with designated client or law firm contacts on specific matters or projects, and it can populate time compilations in relation to one or more legal matters.</p><p>Its platform offering connects with subscribers' existing productivity tools, which typically obviates the need for users to master new work processes, which Time Miner views as a key strategic advantage.</p><p>While many comparable offerings in the market emphasize contemporaneous time capture, Time Miner sees its on-schedule or on-demand retrospective capture as an important differentiator. Table stakes call for the company's commitment to \"bank-grade\" encryption (AES-256) and security, as well as data centers that are ISO 27001 and SSAE Type II certified.</p><p><strong>Monica Mackie</strong><br>In addition to Sean Martin and Michael O'Dell (O'Dell having previously made a personal Angel investment in the business), members of Time Miner LLC include co-founders Pierce Schubert and Rob Laird (both are attorneys), as well as Angel investors Monica Mackie (a former executive director of the Nashville Bar Association); Josh Henderson, an Angel associated with Hodges & Fooshee Realty Inc.; tech-savvy Kernel Equity; plus, an undisclosed independent Los Angeles area-based entertainment and events professional who participated in Time Miner's 'friends and family' funding.</p><p>Kernel Equity and closely aligned tech strategy, software and web development firm DevDigital LLC have provided tech development for Time Miner for more than four years.</p><p>Time Miner's advisors now include attorneys Ed Landquist and Rob Laird of Baker Donelson. Its accounting is with Marcum and the company banks with Studio Bank.</p><p>Time Miner has over the years had conversations with sector incumbents and with potential strategic and financial investors.</p><p>The management team now focuses intensely on B2B growth, but is well aware of potential exit and inorganic-growth options and acknowledges immediate and prospective competitors in the field broadly defined as \"time-keeping\" space.</p><p>VNC interviews and online research suggest dozens of relevant North American incumbents, including Clio, Thomson Reuters eBillingHub, Smokeball, MyCase, Tabs3, Lollylaw, Juris, Sage Timeslips, Harvest, BambooHR, TSheets (QuickBooks Time), Toggl Track, RescueTime, ClickTime, Timely, TrackingTime, Hourstack, TimeClock Plus (TCPSoftware), BigTime, and human-cap management systems from Workday and Oracle, among many others.</p><p>Going forward, Time Miner's priority is on creating and securing additional integrations with major lawtech-oriented platforms.</p><p>The company already enjoys integration partnerships with Canada-based Clio (Themis Solutions Inc.), a company that offers a cloud-based legal practice-management platform; and with RingCentral, the VOIP telephone and communications solutions provider.</p><p>Notably, Nashville's Gaylord Opryland Resort & Convention Center will serve as host for the two-day 11th Clio Cloud Conference, focused on the tech needs of the legal profession, Oct. 9-10. Clio says it will release its widely followed annual Legal Trends Report during the conference.</p><p>VNC research indicates Clio has previously completed at least nine investments and acquisitions. In 2021, shortly after completing its Series E raise, Clio attained a reported $1.6 billion valuation.</p><p>Also suggestive of the sector's appetite for innovation, Clio recently announced its appointment of a new chief product officer, charged with expanding Clio's integration ecosystem, among other duties.</p><p>Notably, today the Time Miner website also lists current or pending integrations with Practice Panther, MyCase, Microsoft 365 Outlook, Gmail, and (under development) AT&T, Verizon, and T-Mobile.</p><p>Looking farther ahead, the Time Miner team has white-boarded future growth opportunities, including a possible time-tracking offering for use in K-12 school systems. It recently began conversations with one or more state education commissions.</p><p>Martin, who was born in Michigan, reared in Southern California and moved to Nashville 26 years ago, remains founder and partner of the Martin Heller Potempka & Sheppard (MHPS) law firm. He resides in Davidson County with his wife and son. LinkedIn profile is here.</p><p><strong>Michael O'Dell</strong><br>Michael O'Dell MBA is managing partner of Kernel Equity and brings two-plus decades of U.S. and UK-centered technology market development, sales and marketing, and talent development experience to the company.</p><p>O'Dell is an Illinois native who came to Nashville in 1996 and holds degrees from Thunderbird (now part of Arizona State University) and Lipscomb University. LinkedIn here. He resides in Brentwood with his wife and three children.</p><p>Time Miner also relies on Rahul Upadhyay, who is head of technology within Kernel. Time Miner, itself, has no workers with FTE status, as yet.</p><p>Time Miner's founders submitted a U.S. patent application in 2018, but a patent has not yet been forthcoming. Google Patents.</p><p>Related background material: Reuters-Georgetown report | ABA | JDSupra | Aderant | Clio 2022 report . VNC</p><h4>Be Social:</h4><ul><li><a href=\"https://www.linkedin.com/company/time-miner\">LinkedIn</a></li><li><a href=\"https://twitter.com/time_miner\">Twitter</a></li><li><a href=\"https://www.facebook.com/timeminer\">Facebook</a></li></ul>",
        "createdBy": "Milt Capps",
        "createdAt": "20/06/2023"
    },
    {
        "slug": "otherleft-ventures",
        "title": "Nashville Entrepreneurs Launch Health Care Venture Studio OtherLeft Ventures",
        "category": "Business",
        "coverImage": "https://kernel-images.s3.amazonaws.com/blog/otherleft-ventures-launch.jpg",
  "content": "<p>Nashville has another new venue to grow health care startups.</p><p>Entrepreneurs <a href=\"https://www.bizjournals.com/nashville/search/results?q=Peter+Marcum\" target=\"_blank\">Peter Marcum</a>, <a href=\"https://www.bizjournals.com/nashville/search/results?q=Rodney+Hamilton\" target=\"_blank\">Dr. Rodney Hamilton</a> and <a href=\"https://www.bizjournals.com/nashville/search/results?q=Blaine+Anderson\" target=\"_blank\">Blaine Anderson</a> have launched OtherLeft Ventures, a health care-focused venture studio providing seed capital and product development for health-tech startups, according to a news release. Blattner Technologies is a co-founding investor in OtherLeft.</p><p>The launch comes as Nashville’s health-tech scene has exploded in recent years, garnering rounds of funding as high as nine figures. Local hospital operators have also gotten into the mix, launching their own innovation studios. Brentwood-based LifePoint Health launched its in-house innovation studio, 25m Health, in 2021 with $20 million in seed money. In February, Ardent Health Services announced a partnership with fellow Nashville-based firm SwitchPoint Ventures to launch its own innovation studio.</p><p>OtherLeft will act as both a co-founder in startups alongside entrepreneurs, as well as an investor, according to the release. The studio will center on B2B software startups and has closed its first investment.</p><p>\"We are looking for driven problem-solvers who are serving the healthcare industry. We are focused on innovators at the earliest stages, even idea-only, though we will consider companies who are further along,” Anderson said in the release. \"We are seeking founders or companies with innovative ideas that can really benefit from adding an experienced cofounder with a solid process and methodology.\"</p><p>Anderson is the founder of custom software design and development firm PointClear Solutions, which is headquartered in Franklin.</p><p>Marcum is a serial entrepreneur, founding Nashville Computer Liquidators, a company that bought and resold technology inventory, in the 1990s and building its revenue to $96 million. He is also the founder of Nashville-based tech firm DevDigital.</p><p>Hamilton is the CEO and co-founder of Franklin-based SpendCare Inc., according to his LinkedIn page, and was formerly CEO of Greenlight and DigiChart Inc.</p><p>\"Our aim is to mitigate typical failure points one often encounters as an entrepreneur creating a startup in a complicated industry such as healthcare,” Hamilton said in the release. \"We have brought together a proven ecosystem of top talent in the areas of healthcare domain expertise, human-centered design, product management, software development, sales, marketing and legal/financial services.”</p><p><em>Source: <a href=\"https://www.bizjournals.com/nashville/inno/stories/news/2023/05/05/entrepreneurs-launch-otherleft-ventures-health-car.html?utm_source=st&utm_medium=en&utm_campaign=ae&utm_content=NA&j=31394627&senddate=2023-05-05\" target=\"_blank\">Nashville Business Journal</a></em></p><h4>Be Social:</h4><ul><li><a href=\"https://www.linkedin.com/company/otherleft-ventures\">LinkedIn</a></li><li><a href=\"https://twitter.com/otherleft\">Twitter</a></li><li><a href=\"https://www.facebook.com/otherleftventures\">Facebook</a></li></ul>",
        "createdBy": "Joel Stinnett",
        "createdAt": "05/05/2023"
    },
    {
        "slug": "otherleft-ventures-launch",
        "title": "OtherLeft Ventures Launches Healthcare-Focused Venture Studio in Nashville",
        "category": "Business",
        "coverImage": "https://kernel-images.s3.amazonaws.com/blog/otherleft-ventures-healthcare.jpg",
        "content": "<p>New venture studio reduces risk of building new ventures by combining financial capital, human capital, and analytical rigor.</p><p><strong>NASHVILLE, Tenn., May 2, 2023 /PRNewswire/</strong> — OtherLeft Ventures, a healthcare-focused venture studio, launched in Nashville early this year. OtherLeft Ventures is a cofounding platform that provides seed capital as well as product development expertise for SaaS startups in the healthcare technology space. OtherLeft Ventures was founded by long-time entrepreneurs <a href=\"https://www.bizjournals.com/nashville/search/results?q=Rodney+Hamilton\" target=\"_blank\">Rodney Hamilton, M.D.</a>, <a href=\"https://www.bizjournals.com/nashville/search/results?q=Blaine+Anderson\" target=\"_blank\">Blaine Anderson</a>, and <a href=\"https://www.bizjournals.com/nashville/search/results?q=Peter+Marcum\" target=\"_blank\">Peter Marcum</a>, who saw a need for a more hands-on approach to building startups. In addition to the founders, Blattner Technologies is a co-founding investor in the studio.</p><p>Unlike accelerators, incubators, angel groups, and traditional VC, OtherLeft Ventures acts as both a cofounder with talented entrepreneurs as well as an investor. Venture studios are unique in that they engage with concepts as early as the problem-identification stage, on through scaling, providing both seed capital as well as an initial team and process.</p><p>OtherLeft Ventures reduces risk of building new ventures by combining financial capital, human capital, and analytical rigor. “Our aim is to mitigate typical failure points one often encounters as an entrepreneur creating a startup in a complicated industry such as healthcare,” explains Hamilton. “We have brought together a proven ecosystem of top talent in the areas of healthcare domain expertise, human-centered design, product management, software development, sales, marketing, and legal/financial services.”</p><p>“We are looking for driven problem-solvers who are serving the healthcare industry. We are focused on innovators at the earliest stages, even idea-only, though we will consider companies who are further along,” says Anderson. “We are seeking founders or companies with innovative ideas that can really benefit from adding an experienced cofounder with a solid process and methodology.”</p><p>The new studio has closed its first investment and is actively looking for additional seed-stage opportunities that fit with their investment process and thesis.</p><p>OtherLeft Ventures is a Nashville-based healthcare-focused venture studio co-creating new B2B software businesses with driven entrepreneurs and innovators.</p><p>Email us at <a href=\"mailto:358019@email4pr.com\">358019@email4pr.com</a> or visit our website at <a href=\"http://www.otherleftventures.com\" target=\"_blank\">www.otherleftventures.com</a></p><p><strong>Contact Information:</strong><br>OtherLeft Ventures, LLC<br>Blaine Anderson<br>256.337.8255<br><a href=\"mailto:358019@email4pr.com\">358019@email4pr.com</a></p><p><em>Source: <a href=\"https://www.bizjournals.com/nashville/inno/stories/news/2023/05/05/entrepreneurs-launch-otherleft-ventures-health-car.html?utm_source=st&utm_medium=en&utm_campaign=ae&utm_content=NA&j=31394627&senddate=2023-05-05\" target=\"_blank\">Nashville Business Journal</a></em></p><h4>Be Social:</h4><ul><li><a href=\"https://www.linkedin.com/company/otherleft-ventures\" target=\"_blank\">LinkedIn</a></li><li><a href=\"https://twitter.com/otherleft\" target=\"_blank\">Twitter</a></li><li><a href=\"https://www.facebook.com/otherleftventures\" target=\"_blank\">Facebook</a></li></ul>",
        "createdBy": "Investment Newswire",
        "createdAt": "02/05/2023"
    },
    {
        "slug": "time-miner-cloud",
        "title": "Legal Billing App Time Miner Moves to the Cloud",
        "category": "Business",
        "coverImage": "https://kernel-images.s3.amazonaws.com/blog/time-miner-cloud.jpg",
  "content": "<p><strong>Kernel Equity Partner</strong> Time Miner’s billing app for attorneys is now a cloud-based app with a new <a href=\"https://www.timeminer.com/\">website</a>. Moving to a software-as-a-service model offers efficiency and cost savings, with more functionality and software integration options. The new Time Miner also marks a shift from serving individual attorneys to serving law firms. New customers will use the web platform, which launched on April 1, 2023 after almost 10 months of development and testing by DevDigital. Time Miner will continue to support their current mobile app users while the migration to a cloud-based enterprise software platform continues.</p>\n\n<p><strong>About the Time Miner Platform</strong></p>\n\n<p>The tool helps law firms capture billable time from phone calls, text messages, and email exchanges that might be missed in a busy day, week or month. It does this by pulling data from various communication tools and finding billable exchanges.</p>\n\n<p>The platform features more integration options than the previous mobile apps. It currently works with Gmail and Outlook. Integrations with AT&T, T-Mobile, and Verizon are coming soon. Because so many law firms use specialized practice management software for time tracking and other functions, Time Miner also works with a practice management tool for law firms called Clio. Founder, Sean Martin, notes that integrations with Litify, Filevine, Action Step, Practice Panther, and MyCase are on the way.</p>\n\n<p>Extracting information from phone systems is also a must, so the platform allows users to pull data from VoIP provider RingCentral. Time Miner will also work with Dialpad, Ooma, and Vonage in a future iteration. Users are also able to suggest new integrations.</p>\n\n<p><strong>About the Mobile App</strong></p>\n\n<p>The Time Miner app for Apple and Android devices helps busy attorneys find and claim billable time in phone calls, text exchanges, and email messages then invoice clients for the time. Catching all of those small tasks and recording them properly had been an ongoing challenge at law firms where legal staff and support staff are so busy. Time Miner plans to continue supporting the original app until all current users have been migrated to the new system.</p>\n\n<p><strong>About the Company</strong></p>\n\n<p>Time Miner is a Nashville-based technology company founded by two practicing attorneys and an IT consultant. This app is the product of a 2016 conversation at a bar. Co-Founder and Lawyer, Martin, said he had to leave and do his timekeeping for the month. His friend, the IT specialist, asked if there might be an app to handle that. No such thing seemed to exist, so they decided to create one.</p>\n\n<p>Version 1.0 of the Time Miner app went live in 2017. After some feedback on the app, the company did a complete rebuild and launched version 2.0. Development began in June of 2022 and the new timeminer.com platform went live on April 1.</p>\n\n<p><strong>About Kernel and DevDigital</strong></p>\n\n<p>Kernel has backed numerous app development projects since 2017, providing funding, development services, and connections to experienced and successful equity partners. <a href=\"http://www.devdigital.com/\">DevDigital</a> is a Nashville-based tech company that builds custom websites, mobile apps, and enterprise software for clients in a variety of industries. They have provided development services for numerous Kernel companies, including Time Miner, for whom DevDigital developed the software. The support of Kernel Equity and the coding talent of DevDigital’s team have made the move technically and financially viable. You can learn more about other Kernel projects on our <a href=\"https://www.kernelequity.com/portfolio\">Portfolio</a> page.</p>\n\n<p><strong>Be Social :</strong></p>",
        "createdBy": "Admin",
        "createdAt": "21/04/2023"
    }
]
