{
  "team": [
    {
      "name": "Peter Marcum",
      "position": "Founding Partner",
      "image": "https://dhaval-patel-ke.github.io/kernel-images/kernel/Peter.png",
      "linkedin": "https://www.linkedin.com/in/petermarcum",
      "bio": "Peter Marcum has spent his career building technology companies. As a self-taught computer programmer, Peter entered the information technology field in the early 1980s by developing and selling a public housing software package. In 1985, he started JML Computers to build LANs and WANs. He sold JML Computers and came to Nashville, Tennessee, as owner of Computerland of Nashville. In 1995, Peter founded Nashville Computer Liquidators which reached sales of $100 million. NCL was sold in 2000. He co-founded Essex Technology Group and helped create a large online reseller that later became the brick-and-mortar stores, Bargain Hunt, with 90 retail locations throughout the southeast. TH Lee, a private equity firm, bought Bargain Hunt in November of 2015. In 2003, Peter created WV Fiber, a national fiber network specializing in wholesale bandwidth in eighteen U.S. and five EU colocation centers and served as its CEO. WV Fiber’s customers included Charter Cable’s home users in five states, Akamai, and others. WVFiber bought Usenet Server, as a subsidiary starting with 9,000 clients, building it to 35,000 online customers, and sold it in 2007. When WV Fiber was sold in 2008, its small programming arm was not included in the sale, and later evolved into DevDigital, LLC, which offers Web and application development services. With headquarters in Nashville and a development center in Vadodara, India, DevDigital has evolved into a full-service software developer that also offers SEO, learning management systems, and hosting. It currently has 125 full time associates. DevDigital has moved into equity investing as a way to further leverage its capabilities. In 2016, Kernel Equity was launched as a mechanism to invest in projects for education, healthcare, music, e-commerce, and other opportunities. Kernel Equity offers an innovative way for DevDigital to help grow companies that need more than just financing or programming support by providing technical knowledge, development experience, and capital. There have been exits with CoreCommerce, OtherLeft and Maxx Content."
    },
    {
      "name": "Todd McCullough",
      "position": "Partner/Advisor",
      "image": "https://dhaval-patel-ke.github.io/kernel-images/kernelTodd.png",
      "linkedin": "https://www.linkedin.com/in/todd-a-mccullough/",
      "bio": "Todd and Peter Marcum oversee Kernel Equity. Todd has spent a career helping companies of all sizes grow their businesses in a more systematic and repeatable way. He has created and taught the theories and has applied and refined them with clients over many years. Recently, Todd led the effort at North Highland (a global management consultancy) to build a Growth and Innovation practice globally. Todd has advised over 100 of the Fortune 500 companies on the topics of growth strategy and innovation. He helped them learn to innovate and grow in a more disciplined way. Todd has worked extensively in Financial Services, Healthcare, Consumer Packaged Goods, Quick Service Restaurants, Retail and many other industries. In each industry he has worked with the major players to figure out how to differentiate themselves with customers, and against their competition. Todd has also been the ‘consultant to the consultant’ for 5 of the 6 largest management consulting firms in the world. He has coached them on growth strategy, innovation strategy, methods and capabilities. He led Doblin (now Deloitte’s Innovation Strategy group) for a decade and sold it to Monitor group, where he continued as a senior partner in their innovation strategy practice. Todd’s CPA and MBA give him a solid financial background, which he has complemented with design thinking for innovation. He teaches business students and executives (through Vanderbilt, Notre Dame and others) about design, and he teaches design students (through the Institute of Design in Chicago and soon O’More College of Design in Franklin, TN) about business, with the goal of integrating the disciplines for innovation. Representative clients include Ford, McDonald’s, EY, Pfizer, HCA, Subway, Boston Scientific, SC Johnson, Coke, Target and GE, as well as many small firms and start-ups. He brings the toolset and theories from all these experiences to each new relationship. With smaller firms, he has a goal to ‘democratize’ innovation methods and theories, to make them available more broadly."
    },
    {
      "name": "Debby Sapp",
      "position": "Partner & CFO",
      "image": "https://dhaval-patel-ke.github.io/kernel-images/kernelDebby.png",
      "linkedin": "https://www.linkedin.com/in/debby-sapp-b5750666/",
      "bio": "Debby Sapp is the Chief Financial Officer of Kernel Equity, a venture capital investment firm, and previously served as the CFO of DevDigital, a Nashville-based software development company. Debby was on the acquisition team for DevDigital when it was acquired in 2023 and now is full time at Kernel Equity. She oversees all financial operations for six portfolio companies and manages complex international finances, including multi-currency transactions and regulatory compliance across the U.S. and India. With over two decades of financial leadership experience, Debby has successfully navigated diverse industries, including healthcare and music, where she worked with iconic artists such as Alan Jackson and George Jones. At Kernel Equity, Debby has played a key role in multiple successful business exits, including Maxx Content, CoreCommerce, and Other Left. Her expertise in consolidating financial statements and leading strategic transactions has been instrumental in Kernel’s growth. Beyond her professional achievements, Debby is deeply committed to community service, serving as board treasurer for a Christian-based youth camp and as a board member for her church and a special-needs sports foundation, causes that align with her personal passions."
    },
    {
      "name": "Rahul Upadhyay",
      "position": "Partner & Head of Technology",
      "image": "https://dhaval-patel-ke.github.io/kernel-images/kernelRahul.png",
      "linkedin": "https://www.linkedin.com/in/rahulupadhyay27",
      "bio": "Rahul is a seasoned IT professional with over 12 years of experience in the industry. With expertise in Android development, project management, people management, and agile methodologies, he is committed to delivering innovative solutions to clients and stakeholders. Rahul deeply understands the Android platform, Java, and related technologies, and is skilled in implementing creative user interfaces. In addition to his work in IT, Rahul has a passion for photography and enjoys exploring various styles and techniques. He also loves to stay active by biking and cycling, which allows him to stay fit and explore the beauty of the outdoors. Additionally, Rahul is a music enthusiast and enjoys listening to various genres, which helps him to unwind and stay inspired. Rahul is committed to staying up-to-date with industry trends and advancements, constantly seeking to add value and drive results in the field of information technology. His proven track record in project management, leading cross-functional teams, and delivering projects on time and within budget, combined with his expertise in agile methodologies, ensures that he consistently delivers high-quality results in fast-paced and dynamic environments. Whether it's through developing new software solutions, mentoring and leading teams, or pursuing his hobbies and interests, Rahul is dedicated to positively impacting his personal and professional life."
    },
    {
      "name": "Thomas Ross",
      "position": "Partner",
      "image": "https://dhaval-patel-ke.github.io/kernel-images/kernelThomas.png",
      "linkedin": "",
      "bio": "Tom has been with DevDigital since 2011. He is a Senior Project Manager, an SEO & Social Media Consultant/Trainer, a .NET Developer, a Technological Lifeguard, and a Professional Coffee Drinker. He specializes in Enterprise Systems, Search Engine Optimization, and Database Design. Most of his work is in the Health Care and Construction space. He is a graduate of Middle Tennessee State University, and has a BBA in Computer Information Systems and a BS in Economics, and graduated Magna Cum Laude. While in school, Tom founded and presided over three of the largest student organizations and held office in many others. He was also the Southeast Regional Director of Student Veterans of America, and was responsible for the welfare of veterans at every school in 15 states. Tom is also a Veteran with 13 years of service. He spent 12 years with the U.S. Army Military Police, including multiple deployments—his last being 19 months in Iraq. He was then reclassified as a Network Systems Operator/Analyst where he was responsible for all networking and computer related functions of a Combat Support Hospital. He has over 35 citations including the Bronze Star, the Global War on Terrorism Service and Expeditionary Medals, the Iraq Campaign Medal, and the Army Commendation Medal."
    },
    {
      "name": "Mitch Ballard",
      "position": "Member",
      "image": "https://dhaval-patel-ke.github.io/kernel-images/kernelMitch.png",
      "linkedin": "",
      "bio": ""
    },
    {
      "name": "Robert Echols",
      "position": "Member/Advisor",
      "image": "https://dhaval-patel-ke.github.io/kernel-images/kernelRobert.png",
      "linkedin": "",
      "bio": ""
    },
    {
      "name": "Dr. Turner Nashe",
      "position": "Member",
      "image": "https://dhaval-patel-ke.github.io/kernel-images/kernelTurner.png",
      "linkedin": "",
      "bio": "Dr. Turner Nashe, President of IDS - is an entrepreneur, inventor, innovator and recognized leader in building technology that facilitates delivery of educational and entertainment content to security sensitive industries. Dr. Nashe is based in Nashville, TN where he received his doctorate in Educational Administration and Supervision from Tennessee State University. Dr. Nashe also received a Bachelor's degree in Psychology from John Carroll University. Dr. Nashe has built several businesses around proprietary digital delivery systems. These systems provide relevant content to schools, correctional facilities and health care providers. He has worked with firms in the private and public sector as well as governmental entities. His work has attracted firms from start up technology firms to the Fortune 500. His inventions have created innovative solutions for emerging eco-systems that are revolutionizing traditional approaches to delivery of educational content and performance verification within secure facilities. His thought leadership has helped organizations transition from the mental models of an ego-system to the 21st century eco-system. His inventions represent innovative approaches to the use of digital technology as the means to accelerate human development and social performance. While technology is rapidly advancing, Dr. Nashe wants to ensure that it enables and optimizes human development to its fullest potential."
    }
  ]
}
